{
    "general" : "---------------------------? PASSWORD MANAGER HELP ------------------------------\n\nPassword Manager is a password manager developed in python to make\nstoring, protecting and retrieving passwords safe and easy.\nWARNING: The application is still in the Alpha phase and is not recommended\nfor personal use. Only use it for testing purposes.\nEach command is listed below with their corresponding usage.\n",
    "help" : "  This command will list out help information for the application.\n      help    [List out all the commands and their details]\n      help <command>  [This will list out information for the specified command]\n",
    "exit" : "  This command will exit the application.\n",
    "about" : "  This command will show the about information of the application.\n",
    "version" : "  This command will show the version number of the application that you're using.\n",
    "add" : "  This command will add a new profile to the database.\n      add    [Loads the add command with auto-generated password of default size and character set]\n      add <size> <arguements>    [Loads the add command with auto-generated password of size provided and character set provided]\n      add -m    [Loads the add command with a manual password]\n         arguement set - -u(Include uppercase) -n(Include numbers) -c(Include special characters)\n             ex: 'add 13 -c -u' will auto-generate a password 13 characters long with only lowercase, uppercase and special characters\n",
    "edit" : "  This command will edit an existing profile in the database.\n      edit <platform> <username>    [Loads the edit command with auto-generated password of default size\n                 and character set for the provided platform and username]\n      edit <platform> <username> <size> <arguements>    [Loads the edit command with auto-generated password of size provided and character set provided]\n      edit <platform> <username> -m    [Loads the edit command with a manual password]\n         arguement set - -u(Include uppercase) -n(Include numbers) -c(Include special characters)\n             ex: 'edit Instagram Frank 13 -c -u' will auto-generate a password 13 characters long with only lowercase, uppercase and special characters\n",
    "delete" : "  This command will delete an existing profile in the database.\n      delete <platform> <username>    [Loads the delete command for the platform and username]\n",
    "show" : "  This command will show the password of an existing profile in the database.\n      show <platform> <username>    [Loads the show command for the platform and username]\n",
    "copy" : "  This command will copy the password of an existing profile in the database.\n      copy <platform> <username>    [Loads the copy command for the platform and username]\n",
    "platform" : "  This command will list out the platforms in the database.\n      platform    [Will list all the platforms listed in the database]\n      platform <keyword>    [Will list all the platforms listed in the database that match the keyword]\n      platform <keyword> <row>    [Will list all the platforms listed in the database that match the keyword and will list them in the specified row count]\n",
    "username" : "  This command will list out the usernames in the database.\n      username    [Will list all the usernames listed in the database]\n      username <keyword>    [Will list all the usernames listed in the database that match the keyword]\n      username <keyword> <platform>    [Will list all the usernames listed in the database that match the keyword and platform name]\n      username -a <platform>    [Will list all the usernames listed in the database that match only the platform name]\n      username <keyword or -a> <platform> <rows>    [Will list all the usernames listed in the database that match the keyword (or all if -a is provided)\n                 and platform name and will list them in the specified row count]\n"
}